; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	thermograph0 - mode
	infrared1 - mode
	Star1 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	Star0 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet10)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
)
(:goal (and
	(have_image Star6 infrared1)
	(have_image Planet7 infrared1)
	(have_image Planet8 thermograph0)
	(have_image Phenomenon9 infrared1)
	(have_image Planet10 thermograph0)
	(have_image Star11 infrared1)
	(have_image Planet12 thermograph0)
	(have_image Phenomenon13 thermograph0)
	(have_image Phenomenon14 infrared1)
	(have_image Phenomenon15 thermograph0)
))

)

; plan
1. (turn_to satellite0 groundstation2 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 10
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 10
3. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 10
4. (turn_to satellite0 phenomenon15 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon15)
   goals met: 0 of 10
5. (take_image satellite0 phenomenon15 instrument0 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 1 of 10
6. (turn_to satellite0 phenomenon14 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon14)
   goals met: 1 of 10
7. (take_image satellite0 phenomenon14 instrument0 infrared1)
   added: (have_image phenomenon14 infrared1)
   goals met: 2 of 10
8. (turn_to satellite0 phenomenon13 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon13)
   goals met: 2 of 10
9. (take_image satellite0 phenomenon13 instrument0 thermograph0)
   added: (have_image phenomenon13 thermograph0)
   goals met: 3 of 10
10. (turn_to satellite0 phenomenon9 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 10
11. (take_image satellite0 phenomenon9 instrument0 infrared1)
   added: (have_image phenomenon9 infrared1)
   goals met: 4 of 10
12. (turn_to satellite0 planet10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet10)
   goals met: 4 of 10
13. (take_image satellite0 planet10 instrument0 thermograph0)
   added: (have_image planet10 thermograph0)
   goals met: 5 of 10
14. (turn_to satellite0 planet12 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet12)
   goals met: 5 of 10
15. (take_image satellite0 planet12 instrument0 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 6 of 10
16. (turn_to satellite0 planet7 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet7)
   goals met: 6 of 10
17. (take_image satellite0 planet7 instrument0 infrared1)
   added: (have_image planet7 infrared1)
   goals met: 7 of 10
18. (turn_to satellite0 planet8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet8)
   goals met: 7 of 10
19. (take_image satellite0 planet8 instrument0 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 8 of 10
20. (turn_to satellite0 star11 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star11)
   goals met: 8 of 10
21. (take_image satellite0 star11 instrument0 infrared1)
   added: (have_image star11 infrared1)
   goals met: 9 of 10
22. (turn_to satellite0 star6 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star6)
   goals met: 9 of 10
23. (take_image satellite0 star6 instrument0 infrared1)
   added: (have_image star6 infrared1)
   goals met: 10 of 10
